app/views/posts/show.html.erb

<h4>Komentar</h4>
<% if @post.comments.empty? %>
---
SELECT  1 AS one FROM `comments`  WHERE `comments`.`post_id` = 4 LIMIT 1
SELECT `comments`.* FROM `comments`  WHERE `comments`.`post_id` = 4