app/controllers/comments_controller.rb

SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 4 LIMIT 1
INSERT INTO `comments` (`author`, `body`, `created_at`, `post_id`, `updated_at`) VALUES ('aku', 'apa coba', '2014-10-08 05:44:38', 4, '2014-10-08 05:44:38')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:author, :body))

SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 4 LIMIT 1
SELECT `comments`.* FROM `comments`  WHERE `comments`.`post_id` = 4 AND `comments`.`id` IN (3, 4)
DELETE FROM `comments` WHERE `comments`.`id` = 3
---
  def destroy_multiple
    @post = Post.find(params[:post_id])
    @comments = @post.comments.find(params[:comments])
    @comments.each{ |c| c.destroy }