app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO `posts` (`body`, `created_at`, `title`, `updated_at`) VALUES ('OnePiece', '2014-10-08 05:17:31', 'OP', '2014-10-08 05:17:31')

  def index
    @posts = Post.all.order('created_at DESC').paginate(page: params[:page], per_page: 2)
---
SELECT  `posts`.* FROM `posts`   ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM `posts`

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 4 LIMIT 1
UPDATE `posts` SET `title` = 'sacasdadad', `updated_at` = '2014-10-08 09:42:11' WHERE `posts`.`id` = 4